public class Main {
    // Homework
    //I. Есть два листа одинаковой длины с целыми числами. Написать метод, который вернет
    // лист  с элементами Yes или No,  где значение на i-ом месте зависит от того, равны
    // ли элементы двух листов  под номером i.
     // Например: [1,2,3,4] and [5,2,3,7]  вернет [No,Yes,Yes,No]
    // Протестировать

   // 1. public List<String> returnYesOrNo ( List<Integer> list1, List<Integer> list2)
   // 2. создать новый лист стрингов resultYesNo
   // 3. в цикле пройти по листам цедых чисел list1  и list2  сравнивая элементы. Если соотвтествующие элементы
   //    равны, то в лист resultYesNo записывается Yes и No  в противном случае.
   // 4.вернуть результат  , т.е. получившийся лист стрингов resultYesNo


    /*
    II*  Есть лист со строками. Написать метод, возвращающий строку, которая встречается в листе раньше -
         самую короткую или самую длинную. Известно, что все строки в листе разные. Если лист пустой - бросить
         бросить EmptyListException
         пример 1: [bb, a, fff, dddd] -> a - самый короткий  элемент a  встречается раньше
         пример 2: [bb, aaa, ff, d] -> aaa - самый длинный элемент aaa встречается раньше
         Протестировать

        1. public String findShortestOrLongest( List<string> list) throws EmptyListException
        2. проверить не пустой ли лист и если пустой, то бросить exception
        3. В цикле пройти по листу находя максимальный и минимальный  элементы и запомнить их индексы.
        4. Сравнить индексы и вернуть элемент индекс которого будет меньше.

     */




}
