public class Main {

    // Есть массив строк, в котором перечислены марки автомобилей, имеющиеся в наличии в салоне.
    // Написать метод, проверяющий есть ли нужная клиенту машина в салоне. Название машины вводится с клавиатуры
    // ["Audi","Ford","BMW","Honda","Mazda"]

    /*
    1. создать метод public static void findCar(String[] cars, String carToFind)
    2. В цикле for пройти по элементам массива  и четез if  сравнить каждый элемент массива с искомой машиной.
    3. Если нашли, выоводим на экран соответствующее уведомление. Если нет, то уведомление что такой машины
        нет и предложение взять одну из имеющихся в наличии  с перечислением их
     */

    /*
    Написать метод, который при вводе с клавиатуры дня недели отвечает на вопрос является ли этот день выходным.
     ( для выходного it is true , для рабочего it is false.  Использовать ENUM. День недели вводится со сканера.

     1. Создпть Enum, содержащий дни недели.
     2. Создать обьект сканера
     3. В методе используя константы энума сделать switch, который будет возвращать результат true  или false  в зависимости
        от введенного со сканера дня недели

     Вариант со звездочкой :
      -разделить решение на отдельные методы, каждый из которых решает свою задачу
     ( например, ввод значения с клавиатуры).
     - проверить что произойдет в случае неверного ввода с клавиатуры и подумать как решить проблему если она возникнет


     */

}
