public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
//        Задача 1.
//        Написать программу, выводящую на экран результат деления двух
//        чисел     25 и 3.
//        Результат не должен быть округлен до целых. Посчитать также остаток от деления этих чисел.



    }
}