public class Main {


    //  Модификаторы доступа
    /*
    Существует 4 модификатора доступа :
    1. default  - по умолчанию, т.е. когда мы не указываем никакой модификатор.
    Область видимости переменной/метода в этом случае ограничивается пакетом, в котором
    находится класс, содержащий эту переменную/метод

    2. public - переменная/метод с таким модификатором видны везде

    3. private - переменная/метод с таким модификатором видны только в том классе, в котором
      они созданы

     4. protected
     */
}
