public class Main {

    /*
   1.Есть класс автомобиль, в котором есть три поля: марка (make), модель (model) , цена (price). Написать метод, который принимает
    лист автомобилей, а возвращает TreeMap, ключами которой являются марки автомобилей, а значениями будут
    Treeset автомобилей,  в которых автомобили расположены в лексикографическом порядке относительно модели,
    причем дешевые вперед если модели одинаковые ( необходимо сделать Auto comparable,
    чтобы складывать автомобили в TreeSet  в правильном порядке) Написать тесты.

    2.Написать метод, принимающий лист слов , а возвращающий TreeMap, ключами которого являются буквы,
    а значениями - листы слов, начинающихся с данной буквы и расположенных в алфавитном (лексикографическом)
     порядке
     [hello, world, hell] -> { h: [hell,hello], w:[world]}
     Протестировать
     */
}
